diary/2025-01-26.html
<!doctype html>
<html lang="ja">
  <head>
    <meta charset="utf-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1" />
    <title>ABC 390, 言語アップデート 2025 - toybeam</title>
    <meta name="description" content="devlog of toyboot4e" />
    <link rel="stylesheet" href="/style/simple.min.css" />
    <link rel="stylesheet" href="/style/style.css" />
    <link rel="stylesheet" href="/style/prism.css" />
    <!-- MathJax -->
  </head>
  <body>
    <header role="banner">
      <h1>ABC 390, 言語アップデート 2025</h1>
      <p>Jan 26, 2025</p>
      <nav role="navigation">
        <a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a>
      </nav>
    </header>
    <main role="main">
      <h2 id="ABC 390"><a href="#ABC 390">ABC 390</a></h2>
      <p><a href="https://atcoder.jp/contests/abc390">ABC 390</a> に参加しました。<br /></p>

      <table>
        <caption class="t-above">
          <span class="table-number">Table 1:</span>
          Diff 予想
        </caption>

        <colgroup>
          <col class="org-left" />

          <col class="org-right" />

          <col class="org-right" />

          <col class="org-right" />

          <col class="org-left" />

          <col class="org-left" />

          <col class="org-left" />
        </colgroup>
        <thead>
          <tr>
            <th scope="col" class="org-left">問題</th>
            <th scope="col" class="org-right">A 問題</th>
            <th scope="col" class="org-right">B 問題</th>
            <th scope="col" class="org-right">C 問題</th>
            <th scope="col" class="org-left">D 問題</th>
            <th scope="col" class="org-left">E 問題</th>
            <th scope="col" class="org-left">F 問題</th>
          </tr>
        </thead>
        <tbody>
          <tr>
            <td class="org-left">提出</td>
            <td class="org-right">AC</td>
            <td class="org-right">AC</td>
            <td class="org-right">AC</td>
            <td class="org-left">TLE</td>
            <td class="org-left">AC</td>
            <td class="org-left">-</td>
          </tr>

          <tr>
            <td class="org-left">予想 diff</td>
            <td class="org-right">10</td>
            <td class="org-right">50</td>
            <td class="org-right">150</td>
            <td class="org-left">1,000</td>
            <td class="org-left">1,400</td>
            <td class="org-left">2,000</td>
          </tr>

          <tr>
            <td class="org-left">実際 diff</td>
            <td class="org-right">43</td>
            <td class="org-right">147</td>
            <td class="org-right">247</td>
            <td class="org-left">1,607</td>
            <td class="org-left">1,227</td>
            <td class="org-left">1,801</td>
          </tr>
        </tbody>
      </table>
      <h3 id="A 問題">
        <a href="#A 問題"><a href="https://atcoder.jp/contests/abc390/tasks/abc390_a">A 問題</a></a>
      </h3>
      <p>
        \(1, 2, 3, 4, 5\) の順列が与えられたとき、隣接項の入れ替えによって \(1, 2, 3, 4, 5\)
        と一致させられるか答えよ。<br />
      </p>

      <p>
        <a
          href="https://hackage.haskell.org/package/vector-0.13.2.0/docs/Data-Vector-Unboxed.html#v:modify"
          ><code>modify</code></a
        >
        と
        <a
          href="https://hackage.haskell.org/package/vector-0.13.2.0/docs/Data-Vector-Generic-Mutable.html#v:swap"
          ><code>swap</code></a
        >
        の組み合わせで解けます。 Haskeller の A 問題はハードモードです:<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-haskell">solve :: StateT BS.ByteString IO ()
solve = do
  !xs &lt;- intsU'
  let trySwap i =
        let xs' = U.modify (\vec -&gt; GM.swap vec i (i + 1)) xs
         in xs' == U.generate 5 (+ 1)
  printYn . U.or $ U.generate 4 trySwap
</code></pre>
      </div>
      <h3 id="B 問題">
        <a href="#B 問題"><a href="https://atcoder.jp/contests/abc390/tasks/abc390_b">B 問題</a></a>
      </h3>
      <p>
        与えられた数列が等比数列であるか調べよ。公比が分数の場合があり、除算を回避するのが無難です。
        \(a : b = c : d \iff ad = bc\) より比率を比較できます:<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-haskell">solve :: StateT BS.ByteString IO ()
solve = do
  !n &lt;- int'
  !xs &lt;- intsU'
  let x1 = xs G.! 0
  let x2 = xs G.! 1
  let test y1 y2 = y2 * x1 == x2 * y1
  printYn . U.and $ U.zipWith test xs (U.tail xs)
</code></pre>
      </div>

      <p>
        <a href="https://hackage.haskell.org/package/base-4.21.0.0/docs/Data-Ratio.html"
          ><code>Data.Ratio</code></a
        >
        を使う回答が上手いです:<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-haskell">solve :: StateT BS.ByteString IO ()
solve = do
  !n &lt;- int'
  !xs &lt;- intsU'
  let r = xs G.! 0 % xs G.! 1
  let test y1 y2 = y1 % y2 == r
  printYn . U.and $ U.zipWith test xs (U.tail xs)
</code></pre>
      </div>

      <p>
        なお
        <a href="https://hackage.haskell.org/package/base-4.21.0.0/docs/GHC-Real.html#t:Ratio"
          ><code>(%)</code></a
        >
        のソースを見ると、ちゃんと約分してから (GCD で割ってから)
        <code>Ratio</code> に包んでいるようです。確かに約分しての比較で良いですね:<br />
      </p>

      <div class="org-src-container">
        <pre><code class="src language-haskell">-- | 'reduce' is a subsidiary function used only in this module.
-- It normalises a ratio by dividing both numerator and denominator by
-- their greatest common divisor.
reduce ::  (Integral a) =&gt; a -&gt; a -&gt; Ratio a
{-# SPECIALISE reduce :: Integer -&gt; Integer -&gt; Rational #-}
reduce _ 0              =  ratioZeroDenominatorError
reduce x y              =  (x `quot` d) :% (y `quot` d)
                           where d = gcd x y

x % y                   =  reduce (x * signum y) (abs y)
</code></pre>
      </div>
      <h3 id="C 問題">
        <a href="#C 問題"><a href="https://atcoder.jp/contests/abc390/tasks/abc390_c">C 問題</a></a>
      </h3>
      <p>
        2 次元グリッドが与えられたとき、ある長方形 \(R := [x1, x2] \times [y1, y2]\) の中にすべての
        <code>#</code> が収まり、かつ \(R\) の中に <code>.</code> が無いかを調べよ。<br />
      </p>

      <p>2 次元配列のテンプレートを持っていると、定型的なプログラムで処理できます:<br /></p>

      <div class="org-src-container">
        <pre><code class="src language-haskell">solve :: StateT BS.ByteString IO ()
solve = do
  (!h, !w) &lt;- ints2'
  !gr &lt;- getGrid' h w
  let (!ys, !xs) = U.unzip $ findIndicesIV (== '#') gr
  let y1 = U.minimum ys
  let y2 = U.maximum ys
  let x1 = U.minimum xs
  let x2 = U.maximum xs
  printYn $ and [gr @! (y, x) /= '.' | y &lt;- [y1 .. y2], x &lt;- [x1 .. x2]]
</code></pre>
      </div>
      <h3 id="D 問題">
        <a href="#D 問題"><a href="https://atcoder.jp/contests/abc390/tasks/abc390_d">D 問題</a></a>
      </h3>
      <p>
        集合 \(S := \{ A_i \}_i\) を \(\{ S_i \}\) に分割したとき、ユニークな \(\mathrm{XOR} \{
        \mathrm{sum}(S_i) \}_i\) の数を求めよ。 (雰囲気で書きました)<br />
      </p>

      <p>
        \(A_i\) の値域が広い (\(A_i \lt 10^{17}\)) のが絶望的ですが、集合分割の場合の数は
        <a href="https://ja.wikipedia.org/wiki/%E3%83%99%E3%83%AB%E6%95%B0">ベル数</a> らしく、 \(N
        = 12\) の場合は \(10^7\) 未満に収まるそうです。<br />
      </p>

      <p>というわけで、すべての分割 (partition) を列挙すれば解けます。 TLE が厳しい:<br /></p>

      <div class="org-src-container">
        <label class="org-src-name"
          ><span class="listing-number">Listing 1: </span
          ><a href="https://atcoder.jp/contests/abc390/submissions/62126850">2,217 ms</a></label
        >
        <pre><code class="src language-haskell">solve :: StateT BS.ByteString IO ()
solve = do
  !n &lt;- int'
  !xs &lt;- intsU'
  let eval = foldl' xor 0 . map (U.sum . U.backpermute xs . unBitSet n)
  let results = map eval $ partitionsOf (bit n - 1)
  let count = U.length . U.uniq . U.modify (VAI.sortBy compare) $ U.fromList results
  printBSB count
</code></pre>
      </div>
      <h3 id="E 問題">
        <a href="#E 問題"><a href="https://atcoder.jp/contests/abc390/tasks/abc390_e">E 問題</a></a>
      </h3>
      <p>
        制約 \(X \le 5000\) に注目します。ビタミンを価値 (<code>v</code>) 、カロリーを重さ
        (<code>w</code>)
        と言い換えると、概ねナップサック問題です。実装はそんなに難しくないですが、コンテスト中に気付くのが難しい。<br />
      </p>
      <h3 id="F 問題">
        <a href="#F 問題"><a href="https://atcoder.jp/contests/abc390/tasks/abc390_f">F 問題</a></a>
      </h3>
      <p>数列の孤島の数を数えよ。うーん<br /></p>
      <h2 id="Misc"><a href="#Misc">Misc</a></h2>
      <h3 id="言語アップデート 2025"><a href="#言語アップデート 2025">言語アップデート 2025</a></h3>
      <p>
        AtCoder の <a href="https://atcoder.jp/posts/1342">言語アップデート 2025</a> (Discord)
        にて、対応作業を実施しました。<br />
      </p>

      <p>
        gksato さんの
        <a href="https://github.com/gksato/haskell-atcoder-server-gen">server-gen</a>
        のおかげでスムーズに更新できました。レビューも懇切丁寧に実施頂きありがとうございました。<br />
      </p>

      <p>
        一旦インストールスクリプトを提出しました (<a
          href="https://gist.github.com/toyboot4e/2f2c29cc86149de2cd6064636d2feb5e"
          ><code>install.toml</code></a
        >) 。 GHC 9.8.4 に更新された他、以下のパッケージが追加されます:<br />
      </p>

      <ul>
        <li>
          <a href="https://hackage.haskell.org/package/ac-library-hs"><code>ac-library-hs</code></a
          ><br />
          <a href="https://github.com/atcoder/ac-library"><code>ac-library</code></a>
          の移植版です。まだ更新します。<br />
        </li>
        <li>
          <a href="https://hackage.haskell.org/package/ilist"><code>ilist</code></a
          ><br />
          リスト用の <code>imap</code> 関数などが生えます。 MagicHash
          も使っていて良さそうに見えます。<br />
        </li>
        <li>
          <a href="https://hackage.haskell.org/package/hmatrix"><code>hmatrix</code></a
          ><br />
          blas/lapack のラッパーです。<br />
          <ul>
            <li>
              <a href="https://hackage.haskell.org/package/hmatrix-glpk"
                ><code>hmatrix-glpk</code></a
              ><br />
            </li>
            <li>
              <a href="https://hackage.haskell.org/package/hmatrix-gsl"><code>hmatrix-gsl</code></a
              ><br />
            </li>
            <li>
              <a href="https://hackage.haskell.org/package/hmatrix-special"
                ><code>hmatrix-speical</code></a
              ><br />
            </li>
          </ul>
        </li>
        <li>
          <a href="https://hackage.haskell.org/package/monad-memo"><code>monad-memo</code></a
          ><br />
          メモ化のパッケージです。<br />
        </li>
        <li>
          <a href="https://hackage.haskell.org/package/vector-split"><code>vector-split</code></a
          ><br />
          <a href="https://hackage.haskell.org/package/split-0.2.5"><code>split</code></a> の vector
          版です。<br />
        </li>
        <li>
          <a href="https://hackage.haskell.org/package/wide-word"><code>wide-word</code></a
          ><br />
          128 bit 整数、 256 bit 整数のパッケージです。 Barrett reduction などに使用できます。<br />
        </li>
        <li>
          <a href="https://hackage.haskell.org/package/witherable"><code>witherable</code></a
          ><br />
          これが面白そうで気になっています。<br />
        </li>
      </ul>

      <p>まだ若干の更新点があるため、 PR を投げて行きたいと思います。<br /></p>
      <h3 id="INLINE 以外信用しない">
        <a href="#INLINE 以外信用しない"><code>INLINE</code> 以外信用しない</a>
      </h3>
      <p>
        Haskell は 1 行の違いで 10 倍遅くなる言語です。
        <code>Main.hs</code>
        単ファイルだと問題無いのですが、ファイル分割すると顕著な違いが現れます。特に
        <code>INLINE</code> を付けなければ目を当たられなくなるほど遅くなる場合があります。<br />
      </p>

      <p>
        <a
          href="https://hackage.haskell.org/package/vector-algorithms-0.9.0.3/docs/Data-Vector-Algorithms.html"
          ><code>Data.Vector.Algorithms</code></a
        >
        の関数には <code>INLINE</code> が付いていないため、 <code>nub</code>, <code>nubBy</code>,
        <code>nubByMut</code> が鈍足のようです。 gksato さん情報です。<br />
      </p>

      <p>
        またこちらも gksato さん情報ですが、
        <a
          href="https://hackage.haskell.org/package/vector-algorithms-0.9.0.3/docs/Data-Vector-Algorithms-Intro.html#v:sort"
          ><code>Intro.sort</code></a
        >
        などは <code>INLINABLE</code> 指定です。 <code>INLINABLE</code> は実質何もしない pragma
        (体感) なので、やはり特殊化されず低速です。この辺り、
        <a href="https://github.com/toyboot4e/va-bench">ベンチマークを根拠に</a> PR
        を出そうと思います。<br />
      </p>
      <h3 id="キーボード"><a href="#キーボード">キーボード</a></h3>
      <p>
        <a href="https://booth.pm/ja/items/6376654">moNa2</a>
        が欲しいかと言われると、本当に欲しいのは 34 キーの keyball, あるいは狂気の 16
        キー・キーボードです。今持っていないということは、喉から手が出るほど欲しいわけでもないですね……。<br />
      </p>
      <h3 id="音楽"><a href="#音楽">音楽</a></h3>
      <p>
        <a href="https://www.youtube.com/watch?v=D-_l0wSuPqQ">Eluveitie の新曲</a>
        が出ていました。やはり僕の好みからは外れますが、
        <a href="https://www.youtube.com/watch?v=kb8WGig0MLU">Thousandfold</a>
        でスペースリークの悲哀を歌っていて (※) 関心を惹かれます。 ※ 嘘です<br />
        。<br />
      </p>
    </main>
    <footer role="contentinfo">
      <p>Styled with <a href="https://simplecss.org/">Simple.css</a></p>
      <div><a href="/index.html">Home</a><a href="https://github.com/toyboot4e">GitHub</a></div>
    </footer>
  </body>
</html>
